# RoofBase Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoofBase Class
Members See Also
---
Represents all kinds of Roofs.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class RoofBase : HostObject
```

Visual Basic
---
```text
Public Class RoofBase _
	Inherits HostObject
```

Visual C++
---
```text
public ref class RoofBase : public HostObject
```

# Remarks
The RoofBase object represents all kinds of roof in Revit.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..HostObject Autodesk.Revit.DB..::..RoofBase Autodesk.Revit.DB..::..ExtrusionRoof Autodesk.Revit.DB..::..FootPrintRoof
# See Also
RoofBase Members
Autodesk.Revit.DB Namespace